# Importing sqlite module

In [8]:
import sqlite3
import numpy as np # linear algebra
import pandas as pd

# Establishing a connection to our database

In [9]:
conn = sqlite3.connect("employees_store.db")

# Allows us to interact with our database

In [10]:
cursor = conn.cursor()

In [28]:
cursor.execute("""drop table employees""")

# Creating pets table

In [29]:
cursor.execute("""CREATE TABLE employees (employee_id INTEGER PRIMARY KEY AUTOINCREMENT, 
                employee_name TEXT NOT NULL, adress TEXT NOT NULL, gender TEXT NOT NULL, 
                DOB TEXT NOT NULL, salary REAL NOT NULL)""")

# Inserting our first record into our table

In [30]:
cursor.execute(""" INSERT INTO employees (employee_name, adress, gender, DOB, salary)
                VALUES ('john', '11 east ave califonia', 'M', '01/01/1971', 12500.00)""")

# Save data to database

In [31]:
conn.commit()

# List containing new records to be inserted into our table

In [32]:
employees = [
    ('mark', '78 milay usa', 'M', '05/20/1969', 1500.00),
    ('Lisa', '53 califonia  ', 'F', '07/05/1986', 1250.00),
    ('Jacob', '220 turtle street ', 'M', '04/23/1991', 2509.00),
    ('Carol', '18 steishuizen street ', 'F', '07/23/1988', 1125.00),
    ('Lesley', '36 bruma road', 'M', '09/12/1954', 6950.00)
]

#Variable containing insert into statement
sql = 'INSERT INTO employees (employee_name, adress, gender, DOB, salary) VALUES (?,?,?,?,?)'

#Insert multiple records in a single statement
cursor.executemany(sql, employees)

#Save changes to our database
conn.commit()

#Printing the number of rows added to our table
print(cursor.rowcount, "rows were added to the table")

5 rows were added to the table

# Updating our Table

In [33]:
update = """
UPDATE employees
SET employee_name = 'Penny'
WHERE employee_id = 3
"""
#Modifying existing row
cursor.execute(update)

#Save changes to our database
conn.commit()

In [34]:
df = pd.read_sql_query("""SELECT *FROM employees""", conn)
df

,employee_id,employee_name,adress,gender,DOB,salary
0,1,john,11 east ave califonia,M,01/01/1971,12500.0
1,2,mark,78 milay usa,M,05/20/1969,1500.0
2,3,Penny,53 califonia,F,07/05/1986,1250.0
3,4,Jacob,220 turtle street,M,04/23/1991,2509.0
4,5,Carol,18 steishuizen street,F,07/23/1988,1125.0
5,6,Lesley,36 bruma road,M,09/12/1954,6950.0

# Deleting our Table

In [35]:
deletion = """
DELETE FROM employees
WHERE employee_id = 6
"""

#Removing exisiting row from table
cursor.execute(deletion)

#Save changes to our database
conn.commit()

# Viewing names from our emplouyees Table

In [36]:
sql = """
SELECT employee_name
FROM employees
"""
df = pd.read_sql_query(sql, conn)
df

  employee_name
0          john
1          mark
2         Penny
3         Jacob
4         Carol

# Variable containing SELECT statement

In [37]:
sql = """
SELECT *
FROM employees
"""

df = pd.read_sql_query(sql, conn)
df

,employee_id,employee_name,adress,gender,DOB,salary
0,1,john,11 east ave califonia,M,01/01/1971,12500.0
1,2,mark,78 milay usa,M,05/20/1969,1500.0
2,3,Penny,53 califonia,F,07/05/1986,1250.0
3,4,Jacob,220 turtle street,M,04/23/1991,2509.0
4,5,Carol,18 steishuizen street,F,07/23/1988,1125.0

# Variable containing SELECT statement with filtering

In [38]:
sql = """
SELECT *
FROM employees
WHERE gender <> 'M'
"""
df = pd.read_sql_query(sql, conn)
df

,employee_id,employee_name,adress,gender,DOB,salary
0,3,Penny,53 califonia,F,07/05/1986,1250.0
1,5,Carol,18 steishuizen street,F,07/23/1988,1125.0

# Variable containing SELECT statement with filtering

In [40]:
sql = """
SELECT employee_name, salary
FROM employees
WHERE salary BETWEEN 1200.00 AND 1800.00
ORDER BY salary ASC
"""

df = pd.read_sql_query(sql, conn)
df

  employee_name  salary
0         Penny  1250.0
1          mark  1500.0

# Closing connection to our database

In [43]:
conn.close()